//
//  KDSHttpResOption.m
//  xiaokaizhineng
//
//  Created by wzr on 2019/3/18.
//  Copyright © 2019 shenzhen kaadas intelligent technology. All rights reserved.
//

#import "KDSHttpResOption.h"

@implementation KDSHttpResOption

+(NSString *)httpResponseLocalizeWithCode:(NSInteger)code{
    NSString *erroDescrip = [[NSString alloc] init];
    NSDictionary *dict = [[NSDictionary alloc] init];
    dict = @{@"100":@"账号或密码为空",
             @"101":@"账号或密码错误",
             @"102":@"SN格式不正确",
             @"113":@"升级任务不存在",
             @"201":@"设备未绑定",
             @"202":@"设备已绑定",
             @"204":@"注册账户失败",
             @"208":@"修改密码失败",
             @"210":@"当前已是最新版本",//@"查无结果",
             @"301":@"字符长度超出限制",
             @"302":@"留言失败",
             @"400":@"请求数据或格式不对",
             @"401":@"数据参数不对",
             @"402":@"要赋权用户没找到",
             @"403":@"device not found",
             @"404":@"资源未找到",
             @"405":@"用户重复注册",
             @"406":@"不需要显示验证码",
             @"407":@"mqtt server connect fail",
             @"408":@"查无该用户",
             @"409":@"设备重复注册",
             @"410":@"用户不存在",
             @"411":@"要赋权用户没找到！",
             @"412":@"设备已被绑定，请解绑后再添加",
             @"413":@"图片质量过大，无法上传",
             @"414":@"don’t register user ,memenet",
             @"415":@"设备注册失败 重复的记录！",
             @"416":@"已经存在用户",
             @"419":@"无法查找设备",
             @"431":@"上传pushid失败",
             @"433":@"您不是设备管理员，无权限分享",
             @"435":@"密码只能数字和字母组合，6-15位",
             @"436":@"数据不是映射关系",
             @"444":@"没有登录",
             @"445":@"验证码无效",
             @"499":@"操作频繁，稍后再试",
             @"500":@"服务器出小差",
             @"501":@"业务处理失败",
             @"509":@"服务请求处理超时",
             @"539":@"api接口更新失敗",
             @"567":@"批量注册用户失败",
             @"592":@"SN和password1与mac映射不对",
             @"601":@"获取昵称失败",
             @"602":@"修改推送开关失败",
             @"603":@"修改昵称失敗",
             @"607":@"上传文件失败",
             @"704":@"验证码发送次数过多，稍后再试",
             @"711":@"register memenet fail",
             @"780":@"登出失败",
             @"781":@"添加设备失败",
             @"782":@"操作失败",
             @"785":@"开锁失败！",
             @"801":@"恶意登录",
             @"803":@"开锁失败,当前时间没有权限",
             @"806":@"非法数据",
             @"812":@"已经通知管理员确认",
             @"813":@"已经绑定了网关",
             @"816":@"审批失败",
             @"819":@"获取列表失败",
             @"820":@"获取网关设备列表失败",
             @"823":@"获取开锁记录失败",
             @"845":@"解绑失败",
             @"847":@"不是网关管理员",
             @"871":@"绑定网关失败",
             @"946":@"mimi绑定网关失败",
             @"947":@"审批mimi绑定网关失败",
             @"991":@"生产失败",
             @"999":@"资源未找到",
             };
    erroDescrip = [dict objectForKey:[NSString stringWithFormat:@"%ld",(long)code]];
    return erroDescrip;
}

@end
